book/assets/assessments/hangmanRAssessment.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-14 Tue 05:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Hangman in R</title>
<meta name="author" content="Britt Anderson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Hangman in R</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5b28488">1. Words of Encouragement</a></li>
<li><a href="#orgd1cdbfe">2. Task</a></li>
<li><a href="#orgba32730">3. Detail (basically the same as before, with minor adaptations)</a></li>
<li><a href="#orgf026990">4. Comments</a>
<ul>
<li><a href="#org2922afe">4.1. How I Will Grade</a></li>
<li><a href="#org0ea8c18">4.2. Hints</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org5b28488" class="outline-2">
<h2 id="org5b28488"><span class="section-number-2">1.</span> Words of Encouragement</h2>
<div class="outline-text-2" id="text-1">
<p>
This was hard in Python, and won't be trivial in R, but having done it once, the translation should be easier. But R is not as nice when processing text as is Python to text process as Python. So, I will be expecting less full featured functions. Just demonstrate you understand the concepts of what we are trying to achieve. 
</p>
</div>
</div>
<div id="outline-container-orgd1cdbfe" class="outline-2">
<h2 id="orgd1cdbfe"><span class="section-number-2">2.</span> Task</h2>
<div class="outline-text-2" id="text-2">
<p>
To write the beginning pieces of a hangman game in R. This version will <a href="https://en.wikipedia.org/wiki/Hard_coding">hard code</a> the word to be guessed. It will not produce any sort of graphic, but merely ask for letters and report if the player spells out the word or not.  Note that as R is harder to run as a program from the command line I will test your code by loading it into my R interpreter. The command for this is <code>source</code>.  I will download your <code>filename.R</code> and then I will <code>source(filename.R)</code>. Next, I will execute whatever function you tell me to. Remember, your script can contain comments so I should be able to tell what you want me to do just by reading your .R file. 
</p>
</div>
</div>
<div id="outline-container-orgba32730" class="outline-2">
<h2 id="orgba32730"><span class="section-number-2">3.</span> Detail (basically the same as before, with minor adaptations)</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Get input from me, the user.</li>
<li>Write a function that takes that input and and returns <b>a list of</b> indices of the positions where the input letter exists in your hard-coded word. An empty list means the letter is never in the word. Otherwise the elements of this list are the indices where that letter is found. For example, if the word were tree and the letter "e" you would get back <code>[1] 3 4</code> from this function. Remember that R starts counting from 1, not zero. , but would get back <code>integer(0)</code> if the letter were 's'. This weirdness tells you why R might be nicer for statistics, but not for text processing. Different task require different tools.</li>
<li>Write a function that loops through the above process a certain number of times.</li>
<li>Make the function terminate when all the letters are guessed or max number of guesses is exceeded.</li>
</ol>
</div>
</div>

<div id="outline-container-orgf026990" class="outline-2">
<h2 id="orgf026990"><span class="section-number-2">4.</span> Comments</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org2922afe" class="outline-3">
<h3 id="org2922afe"><span class="section-number-3">4.1.</span> How I Will Grade</h3>
<div class="outline-text-3" id="text-4-1">
<p>
I will load (source) your file and try to test the functions. If they basically work then you will get the credits. 
</p>
</div>
</div>
<div id="outline-container-org0ea8c18" class="outline-3">
<h3 id="org0ea8c18"><span class="section-number-3">4.2.</span> Hints</h3>
<div class="outline-text-3" id="text-4-2">
<p>
You might find the following R functions helpful:
</p>
<ol class="org-ol">
<li>which</li>
<li>strsplit</li>
<li>unlist</li>
<li>!=</li>
<li>Using a variable more than once, e.g. al[al != "e"]</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Britt Anderson</p>
<p class="date">Created: 2023-02-14 Tue 05:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>